Diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
//{{ВКМ: Устанавливаем видимость Реквизитов договора абонентского обслуживания
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;       
	КонецЕсли;
	
КонецПроцедуры 
//}}ВКМ

//{{ВКМ: Меняем видимость реквизитов в зачисимости от выбранного вида договора 
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
    
    Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
        Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина;
        Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Истина;
        Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
        Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина; 
    Иначе 
        Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;
        Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Ложь;
        Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
        Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
        
        Объект.ВКМ_НачалоДействияДоговора = Неопределено;
        Объект.ВКМ_ОкончаниеДействияДоговора = Неопределено;
        Объект.ВКМ_СуммаАбонентскойПлаты = Неопределено;
        Объект.ВКМ_СтоимостьЧасаРаботы = Неопределено;
    КонецЕсли;   
    
КонецПроцедуры
//}}ВКМ
